Tekla.Structures.Drawing.DrawingEnumerator
The DrawingEnumerator class provides the means to iterate through drawing instances. Drawing enumerators
are generated by the drawing handler.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
DrawingHandler DrawingHandler = new DrawingHandler();
// Loop through all available drawings and delete all GA drawings.
DrawingEnumerator AllDrawings = DrawingHandler.GetDrawings();
while(AllDrawings.MoveNext())
{
Drawing CurrentDrawing = AllDrawings.Current as GADrawing;
if(CurrentDrawing != null)
{
CurrentDrawing.Delete();
}
}
}
}

Tekla.Structures.Drawing.DrawingEnumerator.Current
Gets the current drawing.

Tekla.Structures.Drawing.DrawingEnumerator.GetCurrent
Returns the current item as an object. Needed to make IEnumerator.Current work correctly.
Returns: The current item as an object.